Revit 2026 API

# ExternalResourceServerExtensions Class

---

An object that contains overrides for external resource-specific methods.

SystemObject Autodesk.Revit.DBExternalResourceServerExtensions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalResourceServerExtensions : IDisposable
```
```vb
Public Class ExternalResourceServerExtensions
	Implements IDisposable
```
```cpp
public ref class ExternalResourceServerExtensions : IDisposable
```
```fsharp
type ExternalResourceServerExtensions =
    class
        interface IDisposable
    end
```

The ExternalResourceServerExtensions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExternalResourceServerExtensions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCADLinkOperations | Gets the specific methods supported by external resource CAD Links. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRevitLinkOperations | Gets the specific methods supported by the external resource of Revit Links. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class permits assignment of some specific operations related to a type of external resource, such as what to do when "Open (and Unload)" happens, or when "Shared Coordinates update" happens for Revit or CAD links.

There is no feedback to the UI server for ExternalResourceServerExtensions. Revit will use standard, common message dialogs to handle any error conditions.

#### Reference

Autodesk.Revit.DB Namespace